#+TITLE: MSnbase2 - disk access is the limit
#+AUTHOR: Laurent Gatto and Johannes Rainer

* More new features:
- Can store any combination of MS levels (in-memory =MSnExp= can only
  cope with a single level at a time.)

#+BEGIN_SRC R :session *R*
table(msLevel(on))
#+END_SRC

#+RESULTS:
| 1 |  25 |
| 2 | 270 |
| 3 | 270 |

- Heavy disk access lead to unconvering (and fixing) a few bugs in
  =mzR=!

- Consistent filtering functions

#+BEGIN_SRC R :session *R*
grep("^filter", ls("package:MSnbase"), value = TRUE)
#+END_SRC

#+RESULTS:
| filterAcquisitionNum |
| filterFile           |
| filterMsLevel        |
| filterMz             |
| filterNA             |
| filterRt             |
| filterZero           |

